<template lang="pug">
.proxyEveryone__card.proxyEveryone-card
  .proxyEveryone-card__img
    svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
      rect(width='56', height='56', rx='8', fill='#E9F9EB')
      g(clip-path='url(#clip0_648_1583)')
        path(d='M37.7333 34.5333C38.2666 33.6 38.6666 32.5333 38.6666 31.3333C38.6666 28 36 25.3333 32.6666 25.3333C29.3333 25.3333 26.6666 28 26.6666 31.3333C26.6666 34.6666 29.3333 37.3333 32.6666 37.3333C33.8666 37.3333 34.9333 36.9333 35.8666 36.4L40.1333 40.6666L42 38.8L37.7333 34.5333ZM32.6666 34.6666C30.8 34.6666 29.3333 33.2 29.3333 31.3333C29.3333 29.4666 30.8 28 32.6666 28C34.5333 28 36 29.4666 36 31.3333C36 33.2 34.5333 34.6666 32.6666 34.6666ZM28 38.6666V41.3333C20.64 41.3333 14.6666 35.36 14.6666 28C14.6666 20.64 20.64 14.6666 28 14.6666C34.4533 14.6666 39.8266 19.2533 41.0666 25.3333H38.3066C37.4533 22.0533 35.1066 19.3733 32 18.12V18.6666C32 20.1333 30.8 21.3333 29.3333 21.3333H26.6666V24C26.6666 24.7333 26.0666 25.3333 25.3333 25.3333H22.6666V28H25.3333V32H24L17.6133 25.6133C17.44 26.3866 17.3333 27.1733 17.3333 28C17.3333 33.88 22.12 38.6666 28 38.6666Z', fill='#23C033')
      defs
        clippath#clip0_648_1583
          rect(width='32', height='32', fill='white', transform='translate(12 12)')

  .proxyEveryone-card__title SEO Задачи
  .proxyEveryone-card__description Парсинг поисĸовой выдачи из любых регионов и устройств
</template>

<script>
export default {
  name: "Card",
  props:{
    cardProxy:{
      type: Object,
      required: true,
    }
  }
}
</script>

<style scoped lang="scss">

</style>