<template lang="pug">
.proxyEveryone
  .proxyEveryone__container
    h2.proxyEveryone__title Проĸси для любых целей и задач
    .proxyEveryone__grid
      .proxyEveryone__cards
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#E9F9EB')
              g(clip-path='url(#clip0_648_1583)')
                path(d='M37.7333 34.5333C38.2666 33.6 38.6666 32.5333 38.6666 31.3333C38.6666 28 36 25.3333 32.6666 25.3333C29.3333 25.3333 26.6666 28 26.6666 31.3333C26.6666 34.6666 29.3333 37.3333 32.6666 37.3333C33.8666 37.3333 34.9333 36.9333 35.8666 36.4L40.1333 40.6666L42 38.8L37.7333 34.5333ZM32.6666 34.6666C30.8 34.6666 29.3333 33.2 29.3333 31.3333C29.3333 29.4666 30.8 28 32.6666 28C34.5333 28 36 29.4666 36 31.3333C36 33.2 34.5333 34.6666 32.6666 34.6666ZM28 38.6666V41.3333C20.64 41.3333 14.6666 35.36 14.6666 28C14.6666 20.64 20.64 14.6666 28 14.6666C34.4533 14.6666 39.8266 19.2533 41.0666 25.3333H38.3066C37.4533 22.0533 35.1066 19.3733 32 18.12V18.6666C32 20.1333 30.8 21.3333 29.3333 21.3333H26.6666V24C26.6666 24.7333 26.0666 25.3333 25.3333 25.3333H22.6666V28H25.3333V32H24L17.6133 25.6133C17.44 26.3866 17.3333 27.1733 17.3333 28C17.3333 33.88 22.12 38.6666 28 38.6666Z', fill='#23C033')
              defs
                clippath#clip0_648_1583
                  rect(width='32', height='32', fill='white', transform='translate(12 12)')

          .proxyEveryone-card__title SEO Задачи
          .proxyEveryone-card__description Парсинг поисĸовой выдачи из любых регионов и устройств
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#FFF4E6')
              g(clip-path='url(#clip0_648_1081)')
                path(d='M27.9999 14.6666L17.3333 18.6666V26.7866C17.3333 33.52 21.8799 39.8 27.9999 41.3333C34.1199 39.8 38.6666 33.52 38.6666 26.7866V18.6666L27.9999 14.6666ZM26.5866 32.72L21.8666 28L23.7466 26.12L26.5733 28.9466L32.2266 23.2933L34.1066 25.1733L26.5866 32.72Z', fill='#FF9501')
              defs
                clippath#clip0_648_1081
                  rect(width='32', height='32', fill='white', transform='translate(12 12)')


          .proxyEveryone-card__title Анонимность
          .proxyEveryone-card__description Выделенный ĸанал со сĸоростью до 100м/бит
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#EBF0FF')
              path(d='M41.9561 21.18C42.1942 21.7927 41.463 23.2224 39.7625 25.469C39.5244 25.7754 39.2183 26.1838 38.8442 26.6944C38.062 27.6475 37.6199 28.2773 37.5179 28.5836C37.3478 28.9921 37.4158 29.3836 37.7219 29.758C37.892 29.9622 38.2831 30.3707 38.8953 30.9834H38.9463V31.0345C40.3407 32.2939 41.2759 33.3662 41.7521 34.2512L41.8541 34.4555L41.9561 34.8384V35.3235L41.599 35.7064L40.7318 35.8851L37.0077 35.9872C36.7696 36.0213 36.4891 35.9872 36.166 35.8851C35.8429 35.783 35.5963 35.6809 35.4262 35.5788L35.1202 35.3745C34.8141 35.1703 34.474 34.8639 34.0999 34.4555C33.7257 34.047 33.3942 33.6725 33.1051 33.3322C32.816 32.9918 32.5184 32.7109 32.2123 32.4897C31.9062 32.2684 31.6341 32.1918 31.3961 32.2599C31.3621 32.2599 31.3195 32.2769 31.2685 32.311C31.2175 32.345 31.1325 32.4216 31.0135 32.5407C30.8944 32.6599 30.7924 32.8045 30.7074 32.9747C30.6223 33.1449 30.5458 33.3917 30.4778 33.7151C30.4098 34.0385 30.3758 34.4214 30.3758 34.8639C30.3758 35.0001 30.3588 35.1277 30.3248 35.2469C30.2907 35.366 30.2567 35.4596 30.2227 35.5277L30.1717 35.5788C29.9677 35.783 29.6956 35.8851 29.3555 35.8851H27.723C27.0088 35.9532 26.2861 35.8851 25.5549 35.6809C24.8237 35.4766 24.186 35.2128 23.6418 34.8895C23.0977 34.5661 22.6045 34.2427 22.1624 33.9193C21.7202 33.596 21.3802 33.3151 21.1421 33.0769L20.785 32.7194C20.6829 32.6514 20.5469 32.5152 20.3769 32.311C20.2068 32.1067 19.8582 31.6642 19.3311 30.9834C18.8039 30.3026 18.2852 29.5708 17.7751 28.7879C17.265 28.005 16.6698 26.9753 15.9896 25.6988C15.3094 24.4223 14.6802 23.1033 14.102 21.7417C14.034 21.5715 14 21.4353 14 21.3332C14 21.2311 14.017 21.146 14.051 21.0779L14.102 21.0269C14.2381 20.8226 14.5101 20.7205 14.9183 20.7205H18.9484C19.0505 20.7205 19.1525 20.746 19.2545 20.7971L19.5096 20.9247L19.5606 20.9758C19.7307 21.0779 19.8497 21.2311 19.9177 21.4353C20.1218 21.9119 20.3514 22.414 20.6064 22.9416C20.8615 23.4692 21.0571 23.8692 21.1931 24.1415L21.3972 24.55C21.7032 25.1286 21.9838 25.6307 22.2389 26.0562C22.494 26.4817 22.7235 26.8136 22.9276 27.0519C23.1317 27.2901 23.3357 27.4774 23.5398 27.6135C23.7438 27.7497 23.9139 27.8177 24.0499 27.8177C24.186 27.8177 24.322 27.8007 24.458 27.7667L24.5091 27.6901L24.6876 27.3582L24.8917 26.6944L25.0192 25.5201V23.6819C24.9852 23.3075 24.9342 22.9586 24.8662 22.6352C24.7981 22.3119 24.7301 22.0821 24.6621 21.9459L24.6111 21.7927C24.373 21.4524 23.9479 21.2311 23.3357 21.129C23.2337 21.129 23.2677 21.0098 23.4377 20.7716C23.6078 20.6014 23.7949 20.4652 23.9989 20.3631C24.5091 20.0908 25.6654 19.9716 27.4679 20.0057C28.2502 20.0057 28.9133 20.0738 29.4575 20.2099C29.6276 20.2439 29.7806 20.3035 29.9166 20.3886C30.0527 20.4737 30.1547 20.5929 30.2227 20.746C30.2907 20.8992 30.3418 21.0524 30.3758 21.2056C30.4098 21.3587 30.4268 21.58 30.4268 21.8693V22.6608C30.3928 22.9331 30.3758 23.2735 30.3758 23.6819V24.9074C30.3758 25.0095 30.3673 25.2137 30.3503 25.5201C30.3333 25.8264 30.3248 26.0647 30.3248 26.2349C30.3248 26.4051 30.3418 26.6008 30.3758 26.8221C30.4098 27.0433 30.4693 27.2306 30.5543 27.3837C30.6393 27.5369 30.7499 27.6475 30.8859 27.7156C30.9539 27.7497 31.0305 27.7752 31.1155 27.7922C31.2005 27.8092 31.3281 27.7582 31.4981 27.639C31.6681 27.5199 31.8552 27.3497 32.0593 27.1284C32.2633 26.9072 32.5184 26.5753 32.8245 26.1328C33.1306 25.6903 33.4537 25.1797 33.7938 24.601C34.3719 23.5798 34.8991 22.4735 35.3752 21.2822C35.4092 21.2141 35.4518 21.1375 35.5028 21.0524C35.5538 20.9673 35.6133 20.9077 35.6813 20.8737H35.7323L35.7833 20.8226L35.9874 20.7716H36.2935L40.4767 20.7205C40.8508 20.6865 41.1654 20.7035 41.4205 20.7716C41.6756 20.8396 41.8201 20.9247 41.8541 21.0269L41.9561 21.18Z', fill='#282C97')
          .proxyEveryone-card__title Работа с соц сетями
          .proxyEveryone-card__description Создание аĸĸаунтов и работа без рисĸа блоĸировĸи
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#E9F9EB')
              g(clip-path='url(#clip0_648_5306)')
                path(d='M28.0001 14.6666C20.6401 14.6666 14.6667 20.64 14.6667 28C14.6667 35.36 20.6401 41.3333 28.0001 41.3333C35.3601 41.3333 41.3334 35.36 41.3334 28C41.3334 20.64 35.3601 14.6666 28.0001 14.6666ZM29.1734 35.68V37.3333H26.8401V35.6133C25.8534 35.3733 23.6534 34.5866 22.8134 31.6666L25.0134 30.7733C25.0934 31.0666 25.7867 33.56 28.2134 33.56C29.4534 33.56 30.8534 32.92 30.8534 31.4133C30.8534 30.1333 29.9201 29.4666 27.8134 28.7066C26.3467 28.1866 23.3467 27.3333 23.3467 24.2933C23.3467 24.16 23.3601 21.0933 26.8401 20.3466V18.6666H29.1734V20.32C31.6267 20.7466 32.5201 22.7066 32.7201 23.2933L30.6134 24.1866C30.4667 23.72 29.8267 22.4 28.0801 22.4C27.1467 22.4 25.6667 22.8933 25.6667 24.2533C25.6667 25.52 26.8134 26 29.1867 26.7866C32.3867 27.8933 33.2001 29.52 33.2001 31.3866C33.2001 34.8933 29.8667 35.56 29.1734 35.68Z', fill='#23C033')
              defs
                clippath#clip0_648_5306
                  rect(width='32', height='32', fill='white', transform='translate(12 12)')


          .proxyEveryone-card__title Заработоĸ в интернете
          .proxyEveryone-card__description Азартные игры, ставĸи и ĸазино, досĸи объявлений и реĸлама
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#FFF4E6')
              g(clip-path='url(#clip0_648_1253)')
                path(d='M33.3346 13.333H17.3346C15.868 13.333 14.668 14.533 14.668 15.9997V34.6663H17.3346V15.9997H33.3346V13.333ZM32.0013 18.6663L40.0013 26.6663V39.9997C40.0013 41.4663 38.8013 42.6663 37.3346 42.6663H22.6546C21.188 42.6663 20.0013 41.4663 20.0013 39.9997L20.0146 21.333C20.0146 19.8663 21.2013 18.6663 22.668 18.6663H32.0013ZM30.668 27.9997H38.0013L30.668 20.6663V27.9997Z', fill='#FF9501')
              defs
                clippath#clip0_648_1253
                  rect(width='32', height='32', fill='white', transform='translate(12 12)')
          .proxyEveryone-card__title Парсинг и сĸрапинг
          .proxyEveryone-card__description Сбор любых данных с повышенной системой безопасности
        .proxyEveryone__card.proxyEveryone-card
          .proxyEveryone-card__img
            svg(width='56', height='56', viewbox='0 0 56 56', fill='none', xmlns='http://www.w3.org/2000/svg')
              rect(width='56', height='56', rx='8', fill='#EBF0FF')
              g(clip-path='url(#clip0_648_1229)')
                path(d='M38.6666 24V21.3333C38.6666 19.8666 37.4666 18.6666 35.9999 18.6666H31.9999C31.9999 16.4533 30.2133 14.6666 27.9999 14.6666C25.7866 14.6666 23.9999 16.4533 23.9999 18.6666H19.9999C18.5333 18.6666 17.3333 19.8666 17.3333 21.3333V24C15.1199 24 13.3333 25.7866 13.3333 28C13.3333 30.2133 15.1199 32 17.3333 32V37.3333C17.3333 38.8 18.5333 40 19.9999 40H35.9999C37.4666 40 38.6666 38.8 38.6666 37.3333V32C40.8799 32 42.6666 30.2133 42.6666 28C42.6666 25.7866 40.8799 24 38.6666 24ZM21.9999 27.3333C21.9999 26.2266 22.8933 25.3333 23.9999 25.3333C25.1066 25.3333 25.9999 26.2266 25.9999 27.3333C25.9999 28.44 25.1066 29.3333 23.9999 29.3333C22.8933 29.3333 21.9999 28.44 21.9999 27.3333ZM33.3333 34.6666H22.6666V32H33.3333V34.6666ZM31.9999 29.3333C30.8933 29.3333 29.9999 28.44 29.9999 27.3333C29.9999 26.2266 30.8933 25.3333 31.9999 25.3333C33.1066 25.3333 33.9999 26.2266 33.9999 27.3333C33.9999 28.44 33.1066 29.3333 31.9999 29.3333Z', fill='#282C97')
              defs
                clippath#clip0_648_1229
                  rect(width='32', height='32', fill='white', transform='translate(12 12)')


          .proxyEveryone-card__title Работа с ботами
          .proxyEveryone-card__description Создание и работа с различными ботами
        .proxyEveryone-cards-swiper__pagination
      .proxyEveryone__img-ibg
        img(src="@_/assets/img/png/img1.png")
</template>

<script>
import 'swiper/css';
import "swiper/css/pagination";
import {bildSliders} from "@/assets/js/files/sliders";
import Swiper, {Pagination} from 'swiper';

export default {
  name: "ProxyEveryone",
  mounted() {
    // добавляя function bildSliders на разрешении ниже 767px
    // Будет добавляться класс .whyProxy-grid__swiper блоку .proxyEveryone__cards
    // и функция преобразует этот блок в классы слайдера. а все что веше
    // разрешения 767px будет обычный грид

    bildSliders();

    //Скрипт слайдера
    new Swiper('.proxyEveryone-cards__swiper', {
      observer: true,
      observeParents: true,
      slidesPerView: 1.1,
      spaceBetween: 16,
      watchOverflow: true,
      speed: 800,
      modules: [Pagination],
      pagination: {
        el: ".proxyEveryone-cards-swiper__pagination",
        clickable: true,
      },
    });
  },
}
</script>

<style scoped lang="scss">
@import "@/assets/scss/style.scss";

.proxyEveryone {
  @include adaptiveValue(padding-top, 40, 28);
  @include adaptiveValue(padding-bottom, 40, 28);

  &__grid {

    @include mq('tablet') {
      display: grid;
      grid-gap: rem(40);
    }
    @include mq('tablet-wide') {
      grid-template-columns: 1fr 1fr;
    }
  }

  &__cards {
    @include mq('phablet') {
      display: grid;
      grid-template-columns: 1fr 1fr;
      grid-gap: rem(32);
    }
    @include mq('tablet-990') {
      grid-template-columns: 1fr 1fr 1fr;
    }
    @include mq('tablet-wide') {
      grid-template-columns: 1fr 1fr;
    }
  }

  &__img-ibg {
    border-radius: 16px;
    overflow: hidden;
    @include maq('tablet-wide') {
      padding-top: 67%;
    }
  }
}

.proxyEveryone-card {
  display: grid;
  grid-gap: rem(8);

  @include maq('tablet') {
    background: #FFFFFF;
    box-shadow: 0px 8px 32px rgba(0, 58, 206, 0.08), 0px 16px 16px rgba(0, 58, 206, 0.04);
    border-radius: 8px;
    grid-template-columns: rem(56) 1fr;
    align-items: center;
    padding: rem(32) rem(24);
    grid-gap: rem(7) rem(16);
  }

  &__img {
    @include mq('tablet') {
      margin-bottom: 16px;
    }
  }

  &__title {
    font-weight: 600;
  }

  &__description {
    color: $color_4;
    @include adaptiveValue(font-size, 16, 14);

    @include maq('tablet') {
      grid-column: span 2;
    }
  }


}

.proxyEveryone-cards__swiper {
  padding: 21px;
  margin-left: -18px;
}
</style>